Revit 2026 API

# CeramicCeramicType Property

---

The property labeled "Type" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CeramicType { get; }
```
```vb
Public Shared ReadOnly Property CeramicType As String
	Get
```
```cpp
public:
static property String^ CeramicType {
	String^ get ();
}
```
```fsharp
static member CeramicType : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicType".

#### Reference

Ceramic Class

Autodesk.Revit.DB.Visual Namespace